; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v4 - type_2 ?v7 - type_3)
 	      (pred_2 ?v6 - object ?v7 - type_3)
	      (pred_4 ?v4 - type_2 ?v2 - type_1)
	      (pred_3 ?v4 - type_2 ?v6 - object ?v2 - type_1))

   (:action op_1
       :parameters  (?v4 - type_2 ?v1 ?v3 - type_3)
       :precondition (and  (pred_1 ?v4 ?v1))
       :effect (and  (pred_1 ?v4 ?v3)
		     (not (pred_1 ?v4 ?v1))))

   (:action op_3
       :parameters (?v4 - type_2 ?v5 - object ?v8 - type_3 ?v2 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v8) (pred_1 ?v4 ?v8) (pred_4 ?v4 ?v2))
       :effect (and (pred_3 ?v4 ?v5 ?v2)
		    (not (pred_2 ?v5 ?v8)) 
		    (not (pred_4 ?v4 ?v2))))

   (:action op_2
       :parameters (?v4 - type_2 ?v5 - object ?v8 - type_3 ?v2 - type_1)
       :precondition  (and  (pred_3 ?v4 ?v5 ?v2) (pred_1 ?v4 ?v8))
       :effect (and (pred_2 ?v5 ?v8)
		    (pred_4 ?v4 ?v2)
		    (not (pred_3 ?v4 ?v5 ?v2)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_05 - type_2
obj_02 obj_03 - type_1
obj_01 obj_09 obj_06 obj_07 - type_3
obj_04 obj_08 obj_10 - object)
(:init
(pred_1 obj_05 obj_06)
(pred_4 obj_05 obj_02)
(pred_4 obj_05 obj_03)
(pred_2 obj_04 obj_06)
(pred_2 obj_08 obj_07)
(pred_2 obj_10 obj_09)
)
(:goal
(and
(pred_2 obj_04 obj_07)
(pred_2 obj_08 obj_06)
(pred_2 obj_10 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_05 ?b obj_03))))
)
)

; plan
1. (op_3 obj_05 obj_04 obj_06 obj_02)
   deleted: (pred_2 obj_04 obj_06) (pred_4 obj_05 obj_02)
   added: (pred_3 obj_05 obj_04 obj_02)
   goals met: 0 of 3
2. (op_1 obj_05 obj_06 obj_07)
   deleted: (pred_1 obj_05 obj_06)
   added: (pred_1 obj_05 obj_07)
   goals met: 0 of 3
3. (op_2 obj_05 obj_04 obj_07 obj_02)
   deleted: (pred_3 obj_05 obj_04 obj_02)
   added: (pred_2 obj_04 obj_07) (pred_4 obj_05 obj_02)
   goals met: 1 of 3
4. (op_3 obj_05 obj_08 obj_07 obj_02)
   deleted: (pred_2 obj_08 obj_07) (pred_4 obj_05 obj_02)
   added: (pred_3 obj_05 obj_08 obj_02)
   goals met: 1 of 3
5. (op_1 obj_05 obj_07 obj_06)
   deleted: (pred_1 obj_05 obj_07)
   added: (pred_1 obj_05 obj_06)
   goals met: 1 of 3
6. (op_2 obj_05 obj_08 obj_06 obj_02)
   deleted: (pred_3 obj_05 obj_08 obj_02)
   added: (pred_2 obj_08 obj_06) (pred_4 obj_05 obj_02)
   goals met: 2 of 3
7. (op_1 obj_05 obj_06 obj_09)
   deleted: (pred_1 obj_05 obj_06)
   added: (pred_1 obj_05 obj_09)
   goals met: 2 of 3
8. (op_3 obj_05 obj_10 obj_09 obj_02)
   deleted: (pred_2 obj_10 obj_09) (pred_4 obj_05 obj_02)
   added: (pred_3 obj_05 obj_10 obj_02)
   goals met: 2 of 3
9. (op_1 obj_05 obj_09 obj_01)
   deleted: (pred_1 obj_05 obj_09)
   added: (pred_1 obj_05 obj_01)
   goals met: 2 of 3
10. (op_2 obj_05 obj_10 obj_01 obj_02)
   deleted: (pred_3 obj_05 obj_10 obj_02)
   added: (pred_2 obj_10 obj_01) (pred_4 obj_05 obj_02)
   goals met: 3 of 3
